---
kind: other
id: Methods.T:Autodesk.Revit.DB.MEPAnalyticalConnection
source: html/83c5b8bd-d99a-a6bc-0488-8b5cf389af8d.htm
---
# MEPAnalyticalConnection Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.